#ifndef __Animal__
#define __Animal__

//------------------------------------------------------------------------------
// Animal.h - содержит описание обобщающего животного,
// €вл€ющеес€ базовыым классом дл€ всех прочих животных
//------------------------------------------------------------------------------

#include <fstream>
using namespace std;

//------------------------------------------------------------------------------

//  ласс, обобщающает всх имеющихс€ животных.
// явл€етс€ абстрактным, обеспечива€, тем самым, проверку интерфейса 
class Animal {
public:
	char name[255];
	// иденитфикаци€, порождение и ввод животного из потока
	static  Animal* In(ifstream& ifst);

	virtual void InData(ifstream& ifst) = 0;  // ввод данных из потока
	virtual void Out(ofstream& ofst) = 0;     // вывод данных в стандартный поток
//  protected:
//    Animal() {};
};

#endif
